{
  "backend/main.mo": "Defines the main canister with item storage, category types (including Tin), sorting/filtering, and CRUD queries plus add-item logic.",
  "backend/migration.mo": "Handles migration from older item/category types to the new model that includes the Tin category.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and tests related to adding Tin support and related UI updates.",
  "frontend-file-summaries.txt": "Provides short descriptions of all frontend files and their roles, including Tin support and related UI components.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color variables for light/dark themes.",
  "frontend/index.html": "HTML entry point loading fonts and bootstrapping the React application.",
  "frontend/src/App.tsx": "Main UI with tab navigation, Tin category support, search/sort toolbar, and add-item dialog wiring.",
  "frontend/src/components/branding/AppHeader.tsx": "Top header with logo and collection title for the app.",
  "frontend/src/components/collection/CollectionToolbar.tsx": "Search and sort toolbar component with optional book-specific sort options.",
  "frontend/src/components/collection/EmptyState.tsx": "Empty-state illustration and messaging when no collection items are present.",
  "frontend/src/components/collection/ItemCard.tsx": "Item card displaying photo, category badge (including Tin), metadata, and details dialog trigger.",
  "frontend/src/components/collection/ItemDetailsDialog.tsx": "Displays item details in a dialog, including category-specific info, image preview, timestamp, and metadata.",
  "frontend/src/components/collection/ItemFormDialog.tsx": "Form dialog for creating new items, handling category selection, field inputs, photo upload, and submission.",
  "frontend/src/components/collection/ItemList.tsx": "Renders a grid of item cards with loading skeletons and an empty state when no items exist.",
  "frontend/src/components/collection/PhotoPicker.tsx": "Allows users to upload an image, shows a preview, and converts the file into an ExternalBlob.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useCollectionMutations.ts": "Provides mutation for adding items to the collection and handles cache invalidation and toast notifications.",
  "frontend/src/hooks/useCollectionQueries.ts": "Fetches all items and category-specific filtered lists from the backend using React Query.",
  "frontend/src/hooks/useCollectionViewState.ts": "Manages search and sorting state and provides a function to filter and sort item lists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login state, identity persistence, and authentication provider context.",
  "frontend/src/index.css": "Configures Tailwind layers and defines extensive OKLCH-based design tokens for light and dark themes plus base body styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors and animations using OKLCH CSS variables and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Metadata describing project requirements and existing features for a Girl Scout collection tracking app."
}